tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "gromgit/fuse"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Parser generator
brew "bison"
# Ruby environment tool
brew "chruby"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Fast, distributed, high performance gradient boosting framework
brew "lightgbm"
# Platform built on V8 to build network applications
brew "node"
# Development kit for the Java programming language
brew "openjdk@11"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Python version management
brew "pyenv"
# Command-line interface for SQLite
brew "sqlite"
# Software environment for statistical computing
brew "r"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# General-purpose lossless data-compression library
brew "zlib"
# UNIX shell (command interpreter)
brew "zsh"
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Tools for building Android applications
cask "android-studio"
# GUI app for Homebrew
cask "cakebrew"
# Voice and text chat software
cask "discord"
# Cross-platform Text Expander written in Rust
cask "espanso"
# Free monospaced font with programming ligatures
cask "font-fira-code"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-lobster-two"
cask "font-petit-formal-script"
cask "font-tangerine"
# File system integration
cask "macfuse"
# Open-source download manager
cask "motrix"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Desktop virtualization software
cask "parallels"
# Simplest remote access to your computer from anywhere
cask "parallels-access"
# Bundle with over 30 tools
cask "parallels-toolbox"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Desktop client for WhatsApp
cask "whatsapp"
# Compatibility layer to run Windows applications
cask "wine-devel"
# All-in-one office suite
cask "wpsoffice"
