tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "gromgit/fuse"
tap "heroku/brew"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Ruby environment tool
brew "chruby"
# General-purpose data compression with high compression ratio
brew "xz"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Fast, distributed, high performance gradient boosting framework
brew "lightgbm"
# Development kit for the Java programming language
brew "openjdk@11"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Python version management
brew "pyenv"
# Software environment for statistical computing
brew "r"
# Alternative to backtracking PCRE-style regular expression engines
brew "re2"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# UNIX shell (command interpreter)
brew "zsh"
# Read-write NTFS driver for FUSE
brew "gromgit/fuse/ntfs-3g-mac"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Tools for building Android applications
cask "android-studio"
# GUI app for Homebrew
cask "cakebrew"
# Cross-platform Text Expander written in Rust
cask "espanso"
# File system integration
cask "macfuse"
# Open-source download manager
cask "motrix"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Desktop virtualization software
cask "parallels"
# Simplest remote access to your computer from anywhere
cask "parallels-access"
# Bundle with over 30 tools
cask "parallels-toolbox"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Desktop client for WhatsApp
cask "whatsapp"
# All-in-one office suite
cask "wpsoffice"
