tap "beeftornado/rmtree"
tap "buo/cask-upgrade"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Distributed revision control system
brew "git"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Python version management
brew "pyenv"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# UNIX shell (command interpreter)
brew "zsh"
# Tools for building Android applications
cask "android-studio"
# GUI app for Homebrew
cask "cakebrew"
# Web browser
cask "google-chrome"
# Verify system files structure, run miscellaneous maintenance and more
cask "onyx"
# Desktop virtualization software
cask "parallels"
# Simplest remote access to your computer from anywhere
cask "parallels-access"
# Bundle with over 30 tools
cask "parallels-toolbox"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# System monitor for the menu bar
cask "stats"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# All-in-one office suite
cask "wpsoffice"
