tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Ruby environment tool
brew "chruby"
# Distributed revision control system
brew "git"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Fast, distributed, high performance gradient boosting framework
brew "lightgbm"
# Python version management
brew "pyenv"
# Tools for building Android applications
cask "android-studio"
# Typeface made for developers
cask "font-jetbrains-mono"
cask "font-petit-formal-script"
# Web browser
cask "google-chrome"
# Open-source download manager
cask "motrix"
# Desktop virtualization software
cask "parallels"
# Simplest remote access to your computer from anywhere
cask "parallels-access"
# Bundle with over 30 tools
cask "parallels-toolbox"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Desktop client for WhatsApp
cask "whatsapp"
# All-in-one office suite
cask "wpsoffice"
